eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
#include <Arduino.h>
#include <ArduinoJson.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <Update.h>
#include <WebSocketsClient.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <esp_err.h>
#include <esp_heap_caps.h>
#include <esp_ota_ops.h>
#include <mbedtls/sha256.h>
#include <math.h>
#include <soc/soc_caps.h>
#include "firmware_version.h"

#if __has_include("firmware_version.auto.h")
#include "firmware_version.auto.h"
#endif

#ifndef MICA_FIRMWARE_VERSION
#define MICA_FIRMWARE_VERSION MICA_FIRMWARE_VERSION_FALLBACK
#endif

#if defined(MICA_PROFILE_DMA_EXP)
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#endif

namespace {
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#fluxo-de-execucao
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-128x64-single-canvas-mapping
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---buffer-ws-para-frame-128x64
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-anti-flicker-com-double-buffer
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-upstream-baseline-fluidity-recovery
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-60-fps-com-pacing-fisico-correto
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-diagnostic-matrix-envs
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-fallback-local-de-conectividade
// DOCS: docs/wiki/reference/device-telemetry-v2-fields.md
constexpr uint8_t kBinsCount = MICA_STREAM_BINS;
constexpr size_t kStreamFrameSize = 145;
constexpr size_t kStreamFrame128x64Rgb565Size = 16400;
constexpr size_t kExpectedWebSocketMaxDataSize = 32768;
constexpr uint8_t kStreamVersion = 2;
constexpr uint8_t kStreamBinsMessageType = 1;
constexpr uint8_t kStreamFrame128x64Rgb565MessageType = 2;
constexpr unsigned long kWifiDisconnectProvisioningFallbackMs = 20000;
constexpr unsigned long kMqttReconnectRetryMs = 5000;
constexpr unsigned long kWsReconnectRetryMs = 60000;
constexpr unsigned long kWsAutoReconnectIntervalMs = 2000;
constexpr unsigned long kWsFlapReportWindowMs = 60000;
constexpr uint8_t kWsFlapReportThreshold = 3;
constexpr unsigned long kTelemetryIntervalMs = 2000;
constexpr unsigned long kLoopHealthWindowMs = 5000;
constexpr unsigned long kSerialHelloIntervalMs = 3000;
constexpr unsigned long kMatrixSignalTimeoutMs = 15000;
constexpr unsigned long kConnectivityFallbackDebounceMs = 1000;
constexpr size_t kSerialInputMaxLength = 1024;
constexpr unsigned long kWifiConnectAttemptTimeoutMs = 20000;
constexpr uint32_t kHealthyLoopThresholdUs = 25000;
constexpr uint32_t kNetworkPollBudgetUs = 8000;
constexpr unsigned long kOtaSelfTestWindowMs = 10000;
constexpr uint16_t kDefaultMqttPort = 5273;
constexpr const char* kDefaultMqttRootTopic = "mica/v1/devices";
constexpr uint16_t kMqttPacketBufferBytes = 32768;
constexpr uint8_t kMatrixWidth = MICA_MATRIX_WIDTH;
constexpr uint8_t kMatrixHeight = MICA_MATRIX_HEIGHT;
constexpr uint8_t kMatrixHalfHeight = kMatrixHeight / 2;
constexpr size_t kMatrixPixelCount = static_cast<size_t>(kMatrixWidth) * static_cast<size_t>(kMatrixHeight);
constexpr uint8_t kHub75ColorDepthBits = 6;

#ifndef MICA_HUB75_LATCH_BLANKING
#define MICA_HUB75_LATCH_BLANKING 2
#endif

#ifndef MICA_HUB75_MIN_REFRESH_RATE
#define MICA_HUB75_MIN_REFRESH_RATE 60
#endif

#ifndef MICA_HUB75_CLKPHASE
#define MICA_HUB75_CLKPHASE 0
#endif

#ifndef MICA_HUB75_SHIFT_DRIVER
#define MICA_HUB75_SHIFT_DRIVER 0
#endif

constexpr uint8_t kHub75LatchBlankingPulses = static_cast<uint8_t>(MICA_HUB75_LATCH_BLANKING);
constexpr uint8_t kHub75MinRefreshRate = static_cast<uint8_t>(MICA_HUB75_MIN_REFRESH_RATE);
constexpr bool kHub75ClockPhaseEnabled = MICA_HUB75_CLKPHASE != 0;
constexpr uint8_t kHub75TargetPresentFps = 60;
constexpr uint8_t kMatrixShadowBufferCount = 2;
constexpr uint32_t kMicrosPerSecond = 1000000UL;
constexpr uint32_t kHub75TargetPresentIntervalUs =
    (kMicrosPerSecond + kHub75TargetPresentFps - 1u) / kHub75TargetPresentFps;
constexpr uint32_t kHub75FallbackPresentIntervalUs = 20000UL;
static_assert((kMatrixHeight % 2) == 0, "MICA_MATRIX_HEIGHT must be even.");
static_assert(
    MICA_HUB75_LATCH_BLANKING >= 1 && MICA_HUB75_LATCH_BLANKING <= 4,
    "MICA_HUB75_LATCH_BLANKING must stay between 1 and 4 clock pulses.");
static_assert(
    MICA_HUB75_MIN_REFRESH_RATE >= 1 && MICA_HUB75_MIN_REFRESH_RATE <= 240,
    "MICA_HUB75_MIN_REFRESH_RATE must stay between 1 and 240.");
static_assert(
    MICA_HUB75_CLKPHASE == 0 || MICA_HUB75_CLKPHASE == 1,
    "MICA_HUB75_CLKPHASE must be 0 or 1.");
#if defined(MICA_PROFILE_DMA_EXP) && defined(PIXEL_COLOR_DEPTH_BITS)
static_assert(
    PIXEL_COLOR_DEPTH_BITS == kHub75ColorDepthBits,
    "PIXEL_COLOR_DEPTH_BITS must stay aligned with the official HUB75 baseline profile.");
#endif
#if defined(MICA_PROFILE_DMA_EXP)
static_assert(
    MICA_HUB75_SHIFT_DRIVER == 0 || MICA_HUB75_SHIFT_DRIVER == 1,
    "MICA_HUB75_SHIFT_DRIVER must stay 0 (SHIFTREG) or 1 (FM6124) in this firmware path.");
#endif
#if !defined(WEBSOCKETS_MAX_DATA_SIZE)
#error WEBSOCKETS_MAX_DATA_SIZE must be defined by WebSockets.h.
#endif
static_assert(
    WEBSOCKETS_MAX_DATA_SIZE >= kExpectedWebSocketMaxDataSize,
    "WEBSOCKETS_MAX_DATA_SIZE must stay >= 32768 for HUB75 frame transport.");
static_assert(
    WEBSOCKETS_MAX_DATA_SIZE > kStreamFrame128x64Rgb565Size,
    "Frame128x64Rgb565 payload does not fit in the current WebSockets max frame size.");

enum class MatrixBufferMode : uint8_t {
  Unknown = 0,
  Clear = 1,
  Bars = 2,
  Frame = 3,
};

enum class Hub75FallbackState : uint8_t {
  None = 0,
  NoWifi = 1,
  NoServer = 2,
  Portal = 3,
};

constexpr const char* kBoardModel = "esp32s3_devkitc1";
constexpr const char* kBoardDisplayName = "ESP32-S3 DevKitC-1";
constexpr uint8_t kMatrixRgbPins[6] = {4, 5, 6, 7, 15, 16};
constexpr uint8_t kMatrixAddrPins[5] = {18, 8, 3, 42, 17};
constexpr uint8_t kMatrixClockPin = 41;
constexpr uint8_t kMatrixLatchPin = 40;
constexpr uint8_t kMatrixOePin = 2;
constexpr uint8_t kSerialRxPin = 44;
constexpr uint8_t kSerialTxPin = 43;

