eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
#if defined(MICA_PROFILE_DMA_EXP)
MatrixPanel_I2S_DMA* gMatrix = nullptr;
#if MICA_HUB75_SHIFT_DRIVER == 1
constexpr HUB75_I2S_CFG::shift_driver kHub75BaselineDriver = HUB75_I2S_CFG::FM6124;
#else
constexpr HUB75_I2S_CFG::shift_driver kHub75BaselineDriver = HUB75_I2S_CFG::SHIFTREG;
#endif
#endif

struct RgbColor {
  uint8_t r;
  uint8_t g;
  uint8_t b;
};

struct FirmwareReleaseInfo {
  String firmwareVersion;
  String boardModel;
  String panelType;
  String profile;
  String controlPlane;
  String sha256;
  uint32_t fileSizeBytes = 0;
  String downloadPath;
};

constexpr uint32_t ceilDivideU32(uint32_t numerator, uint32_t denominator) {
  return denominator == 0 ? 0u : (numerator + denominator - 1u) / denominator;
}

const char* hub75FallbackStateName(Hub75FallbackState state) {
  switch (state) {
    case Hub75FallbackState::NoWifi:
      return "no_wifi";
    case Hub75FallbackState::NoServer:
      return "no_server";
    case Hub75FallbackState::Portal:
      return "portal";
    case Hub75FallbackState::None:
    default:
      return "none";
  }
}

size_t matrixPixelIndex(uint8_t x, uint8_t y) {
  return static_cast<size_t>(y) * static_cast<size_t>(kMatrixWidth) + static_cast<size_t>(x);
}

uint16_t rgb888ToRgb565(uint8_t r, uint8_t g, uint8_t b) {
  return static_cast<uint16_t>(((r & 0xF8u) << 8) | ((g & 0xFCu) << 3) | (b >> 3));
}

bool commitMatrixFrame();

void initializeColorConversionLookups() {
  for (uint8_t value = 0; value < 32; value++) {
    gRgb5To8Lut[value] = static_cast<uint8_t>((static_cast<uint16_t>(value) * 255u + 15u) / 31u);
  }

  for (uint8_t value = 0; value < 64; value++) {
    gRgb6To8Lut[value] = static_cast<uint8_t>((static_cast<uint16_t>(value) * 255u + 31u) / 63u);
  }
}

void clearMatrixShadowBuffer(uint8_t bufferIndex) {
  if (bufferIndex >= kMatrixShadowBufferCount) {
    return;
  }

  memset(gMatrixShadowFrames[bufferIndex], 0, sizeof(gMatrixShadowFrames[bufferIndex]));
  memset(gMatrixShadowBarHeights[bufferIndex], 0, sizeof(gMatrixShadowBarHeights[bufferIndex]));
  gMatrixBufferModes[bufferIndex] = MatrixBufferMode::Clear;
}

void resetMatrixShadowState() {
  for (uint8_t bufferIndex = 0; bufferIndex < kMatrixShadowBufferCount; bufferIndex++) {
    clearMatrixShadowBuffer(bufferIndex);
  }

  gMatrixShadowBackBufferIndex = 0;
}

void setMatrixShadowPixel(uint8_t x, uint8_t y, uint16_t rgb565) {
  if (x >= kMatrixWidth || y >= kMatrixHeight) {
    return;
  }

  gMatrixShadowFrames[gMatrixShadowBackBufferIndex][matrixPixelIndex(x, y)] = rgb565;
}

void fillMatrixShadowRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t rgb565) {
  if (w <= 0 || h <= 0) {
    return;
  }

  const int16_t xStart = x < 0 ? 0 : x;
  const int16_t yStart = y < 0 ? 0 : y;
  const int16_t xEnd = (x + w) > static_cast<int16_t>(kMatrixWidth) ? static_cast<int16_t>(kMatrixWidth) : static_cast<int16_t>(x + w);
  const int16_t yEnd = (y + h) > static_cast<int16_t>(kMatrixHeight) ? static_cast<int16_t>(kMatrixHeight) : static_cast<int16_t>(y + h);
  if (xStart >= xEnd || yStart >= yEnd) {
    return;
  }

  for (int16_t row = yStart; row < yEnd; row++) {
    uint16_t* shadowRow =
        gMatrixShadowFrames[gMatrixShadowBackBufferIndex] + (static_cast<size_t>(row) * static_cast<size_t>(kMatrixWidth));
    for (int16_t column = xStart; column < xEnd; column++) {
      shadowRow[column] = rgb565;
    }
  }
}

bool hasPendingOtaContext() {
  return gPendingOtaCommandId.length() > 0
      && gPendingOtaSourceVersion.length() > 0
      && gPendingOtaTargetVersion.length() > 0;
}

bool tryGetRunningOtaState(esp_ota_img_states_t& otaState) {
  const esp_partition_t* runningPartition = esp_ota_get_running_partition();
  if (runningPartition == nullptr) {
    return false;
  }

  return esp_ota_get_state_partition(runningPartition, &otaState) == ESP_OK;
}

bool isRunningAppPendingVerify() {
  esp_ota_img_states_t otaState = ESP_OTA_IMG_UNDEFINED;
  return tryGetRunningOtaState(otaState) && otaState == ESP_OTA_IMG_PENDING_VERIFY;
}

void loadPendingOtaContext() {
  gPendingOtaCommandId = gPrefs.getString(kPrefsOtaCommandId, "");
  gPendingOtaSourceVersion = gPrefs.getString(kPrefsOtaSourceVersion, "");
  gPendingOtaTargetVersion = gPrefs.getString(kPrefsOtaTargetVersion, "");
  gPendingOtaFailureCode = "";
  gPendingOtaFailureMessage = "";
  gPendingOtaValidationStartedMs = 0;
  gPendingOtaPendingVerifyAnnounced = false;
  gPendingOtaBootState = PendingOtaBootState::None;
}

void clearPendingOtaContext() {
  gPrefs.remove(kPrefsOtaCommandId);
  gPrefs.remove(kPrefsOtaSourceVersion);
  gPrefs.remove(kPrefsOtaTargetVersion);

  gPendingOtaCommandId = "";
  gPendingOtaSourceVersion = "";
  gPendingOtaTargetVersion = "";
  gPendingOtaFailureCode = "";
  gPendingOtaFailureMessage = "";
  gPendingOtaValidationStartedMs = 0;
  gPendingOtaPendingVerifyAnnounced = false;
  gPendingOtaBootState = PendingOtaBootState::None;
}

bool persistPendingOtaContext(const String& commandId, const String& sourceVersion, const String& targetVersion) {
  if (commandId.isEmpty() || sourceVersion.isEmpty() || targetVersion.isEmpty()) {
    return false;
  }

  const size_t commandWritten = gPrefs.putString(kPrefsOtaCommandId, commandId);
  const size_t sourceWritten = gPrefs.putString(kPrefsOtaSourceVersion, sourceVersion);
  const size_t targetWritten = gPrefs.putString(kPrefsOtaTargetVersion, targetVersion);
  if (commandWritten == 0u || sourceWritten == 0u || targetWritten == 0u) {
    return false;
  }

  gPendingOtaCommandId = commandId;
  gPendingOtaSourceVersion = sourceVersion;
  gPendingOtaTargetVersion = targetVersion;
  gPendingOtaFailureCode = "";
  gPendingOtaFailureMessage = "";
  gPendingOtaValidationStartedMs = 0;
  gPendingOtaPendingVerifyAnnounced = false;
  gPendingOtaBootState = PendingOtaBootState::None;
  return true;
}

void initializePendingOtaBootState() {
  if (!hasPendingOtaContext()) {
    return;
  }

  if (String(kFirmwareVersion).equalsIgnoreCase(gPendingOtaTargetVersion)) {
    esp_ota_img_states_t otaState = ESP_OTA_IMG_UNDEFINED;
    if (tryGetRunningOtaState(otaState) && otaState == ESP_OTA_IMG_PENDING_VERIFY) {
      gPendingOtaBootState = PendingOtaBootState::PendingVerify;
      gPendingOtaValidationStartedMs = millis();
      Serial.printf("[ota] safe update pendente de validacao. target=%s\n", gPendingOtaTargetVersion.c_str());
      return;
    }

    gPendingOtaBootState = PendingOtaBootState::ValidatedPendingReport;
    Serial.printf("[ota] firmware OTA ativo e aguardando confirmacao tracked. target=%s\n", gPendingOtaTargetVersion.c_str());
    return;
  }

  if (String(kFirmwareVersion).equalsIgnoreCase(gPendingOtaSourceVersion)) {
    gPendingOtaBootState = PendingOtaBootState::RolledBackPendingReport;
    gPendingOtaFailureCode = "ota_rolled_back";
    gPendingOtaFailureMessage = String("Rollback automatico concluido; firmware atual voltou para ") + kFirmwareVersion + ".";
    Serial.printf("[ota] rollback automatico detectado. source=%s target=%s\n",
        gPendingOtaSourceVersion.c_str(),
        gPendingOtaTargetVersion.c_str());
    return;
  }

  gPendingOtaBootState = PendingOtaBootState::FailedPendingReport;
  gPendingOtaFailureCode = "ota_context_mismatch";
  gPendingOtaFailureMessage = String("Contexto OTA inconsistente para firmware atual ") + kFirmwareVersion + ".";
  Serial.printf("[ota] contexto OTA inconsistente. current=%s source=%s target=%s\n",
      kFirmwareVersion,
      gPendingOtaSourceVersion.c_str(),
      gPendingOtaTargetVersion.c_str());
}

RgbColor rainbowColorForColumn(uint16_t column, uint16_t columnCount) {
  if (columnCount <= 1) {
    return {255, 0, 0};
  }

  const uint8_t hue = static_cast<uint8_t>((column * 255u) / (columnCount - 1u));
  const uint8_t region = hue / 43u;
  const uint8_t remainder = static_cast<uint8_t>((hue - (region * 43u)) * 6u);
  const uint8_t q = static_cast<uint8_t>(255u - remainder);
  const uint8_t t = remainder;

  switch (region) {
    case 0:
      return {255, t, 0};
    case 1:
      return {q, 255, 0};
    case 2:
      return {0, 255, t};
    case 3:
      return {0, q, 255};
    case 4:
      return {t, 0, 255};
    default:
      return {255, 0, q};
  }
}

RgbColor rgb565ToRgb888(uint16_t rgb565) {
  return {
      gRgb5To8Lut[(rgb565 >> 11) & 0x1Fu],
      gRgb6To8Lut[(rgb565 >> 5) & 0x3Fu],
      gRgb5To8Lut[rgb565 & 0x1Fu]};
}

bool isReservedHub75Pin(int pin) {
  for (uint8_t gpio : kMatrixRgbPins) {
    if (static_cast<int>(gpio) == pin) {
      return true;
    }
  }

  for (uint8_t gpio : kMatrixAddrPins) {
    if (static_cast<int>(gpio) == pin) {
      return true;
    }
  }

  return pin == static_cast<int>(kMatrixClockPin)
      || pin == static_cast<int>(kMatrixLatchPin)
      || pin == static_cast<int>(kMatrixOePin);
}

bool tryValidateAuxLedPin(int pin, String& reason) {
  if (pin < 0) {
    reason = "desabilitado por build flag";
    return false;
  }

  if (pin >= static_cast<int>(SOC_GPIO_PIN_COUNT)) {
    reason = "fora da faixa de GPIO fisico";
    return false;
  }

  if (isReservedHub75Pin(pin)) {
    reason = "conflito com pinos HUB75";
    return false;
  }

  if (pin == static_cast<int>(kSerialRxPin) || pin == static_cast<int>(kSerialTxPin)) {
    reason = "conflito com serial";
    return false;
  }

