eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  ledcWrite(kTestLedPwmChannel, duty);
}

void applyOnboardTestLedDuty(uint8_t duty) {
  if (!gOnboardTestLedAvailable) {
    return;
  }

#if defined(RGB_BUILTIN) || defined(PIN_NEOPIXEL)
  neopixelWrite(kOnboardTestLedPin, duty, duty, duty);
#else
  (void)duty;
#endif
}

void applyTestLedDutyToOutputs(uint8_t duty) {
  applyAuxTestLedDuty(duty);
  applyOnboardTestLedDuty(duty);
}

void applyTestLedState() {
  if (!isTestLedAvailable()) {
    return;
  }

  if (gTestLedUntilMs > 0) {
    applyTestLedDutyToOutputs(gTestLedState ? gTestLedPulseDuty : 0);
    return;
  }

  if (gAuxLedAvailable && gTestLedEnabled) {
    applyAuxTestLedDuty(gTestLedDuty);
  } else {
    applyAuxTestLedDuty(0);
  }

  applyOnboardTestLedDuty(0);
}

void updateTestLedDutyFromBrightness(uint8_t brightness) {
  if (!gAuxLedAvailable) {
    gTestLedDuty = 0;
  } else if (gTestLedDuty != brightness) {
    gTestLedDuty = brightness;
  }

  gTestLedPulseDuty = brightness;
  if (gTestLedUntilMs == 0) {
    applyTestLedState();
  }
}

void setMatrixBrightness(uint8_t brightness) {
  if (gAppliedBrightness == brightness) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrixReady && gMatrix != nullptr) {
    gMatrix->setBrightness8(brightness);
  }
#endif

  gAppliedBrightness = brightness;
}

void clearMatrix() {
  if (!gMatrixReady) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->clearScreen();
    clearMatrixShadowBuffer(gMatrixShadowBackBufferIndex);
  }
#endif
}

void drawMatrixPixel(uint8_t x, uint8_t y, const RgbColor& color) {

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->drawPixelRGB888(x, y, color.r, color.g, color.b);
    setMatrixShadowPixel(x, y, rgb888ToRgb565(color.r, color.g, color.b));
  }
#endif
}

void fillMatrixRect(int16_t x, int16_t y, int16_t w, int16_t h, const RgbColor& color) {
  if (!gMatrixReady || w <= 0 || h <= 0) {
    return;
  }

  const int16_t xStart = x < 0 ? 0 : x;
  const int16_t yStart = y < 0 ? 0 : y;
  const int16_t xEnd = (x + w) > static_cast<int16_t>(kMatrixWidth) ? static_cast<int16_t>(kMatrixWidth) : static_cast<int16_t>(x + w);
  const int16_t yEnd = (y + h) > static_cast<int16_t>(kMatrixHeight) ? static_cast<int16_t>(kMatrixHeight) : static_cast<int16_t>(y + h);
  if (xStart >= xEnd || yStart >= yEnd) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->fillRect(
        xStart,
        yStart,
        xEnd - xStart,
        yEnd - yStart,
        rgb888ToRgb565(color.r, color.g, color.b));
    fillMatrixShadowRect(xStart, yStart, xEnd - xStart, yEnd - yStart, rgb888ToRgb565(color.r, color.g, color.b));
  }
#endif
}

#if defined(MICA_PROFILE_DMA_EXP)
void drawMatrixTextCentered(const char* text, int16_t baselineY, uint16_t color, uint8_t textSize) {
  if (gMatrix == nullptr || text == nullptr || text[0] == '\0') {
    return;
  }

  int16_t x1 = 0;
  int16_t y1 = 0;
  uint16_t textWidth = 0;
  uint16_t textHeight = 0;
  gMatrix->setTextWrap(false);
  gMatrix->setTextSize(textSize);
  gMatrix->getTextBounds(text, 0, baselineY, &x1, &y1, &textWidth, &textHeight);

  int16_t cursorX = ((static_cast<int16_t>(kMatrixWidth) - static_cast<int16_t>(textWidth)) / 2) - x1;
  if (cursorX < 0) {
    cursorX = 0;
  }

  gMatrix->setCursor(cursorX, baselineY);
  gMatrix->setTextColor(color);
  gMatrix->print(text);
}

void drawConnectivityFallbackIcon(Hub75FallbackState state, uint16_t accentColor, uint16_t neutralColor) {
  if (gMatrix == nullptr) {
    return;
  }

  constexpr int16_t kIconCenterX = kMatrixWidth / 2;
  constexpr int16_t kIconTopY = 8;
  switch (state) {
    case Hub75FallbackState::NoWifi:
      gMatrix->fillRect(kIconCenterX - 11, kIconTopY + 8, 3, 4, neutralColor);
      gMatrix->fillRect(kIconCenterX - 4, kIconTopY + 5, 3, 7, neutralColor);
      gMatrix->fillRect(kIconCenterX + 3, kIconTopY + 2, 3, 10, neutralColor);
      gMatrix->drawLine(kIconCenterX - 14, kIconTopY + 12, kIconCenterX + 10, kIconTopY, accentColor);
      gMatrix->drawLine(kIconCenterX - 13, kIconTopY + 12, kIconCenterX + 11, kIconTopY, accentColor);
      break;
    case Hub75FallbackState::NoServer:
      gMatrix->drawRect(kIconCenterX - 12, kIconTopY + 1, 24, 12, neutralColor);
      gMatrix->fillRect(kIconCenterX - 8, kIconTopY + 4, 3, 3, accentColor);
      gMatrix->fillRect(kIconCenterX - 1, kIconTopY + 4, 3, 3, accentColor);
      gMatrix->fillRect(kIconCenterX + 6, kIconTopY + 4, 3, 3, accentColor);
      gMatrix->drawLine(kIconCenterX - 5, kIconTopY + 16, kIconCenterX + 5, kIconTopY + 16, neutralColor);
      gMatrix->drawLine(kIconCenterX, kIconTopY + 13, kIconCenterX, kIconTopY + 18, neutralColor);
      break;
    case Hub75FallbackState::Portal:
      gMatrix->fillRect(kIconCenterX - 1, kIconTopY + 8, 3, 6, neutralColor);
      gMatrix->drawLine(kIconCenterX - 7, kIconTopY + 12, kIconCenterX - 1, kIconTopY + 9, accentColor);
      gMatrix->drawLine(kIconCenterX + 1, kIconTopY + 9, kIconCenterX + 7, kIconTopY + 12, accentColor);
      gMatrix->drawLine(kIconCenterX - 11, kIconTopY + 14, kIconCenterX - 3, kIconTopY + 10, accentColor);
      gMatrix->drawLine(kIconCenterX + 3, kIconTopY + 10, kIconCenterX + 11, kIconTopY + 14, accentColor);
      break;
    case Hub75FallbackState::None:
    default:
      break;
  }
}
#endif

Hub75FallbackState resolveHub75FallbackCandidate() {
  if (gProvisioningPortalActive) {
    return Hub75FallbackState::Portal;
  }

  if (WiFi.status() != WL_CONNECTED) {
    return Hub75FallbackState::NoWifi;
  }

  if (!gWs.isConnected()) {
    return Hub75FallbackState::NoServer;
  }

  return Hub75FallbackState::None;
}

Hub75FallbackState resolveHub75FallbackState(unsigned long nowMs) {
  const Hub75FallbackState candidate = resolveHub75FallbackCandidate();
  if (candidate == Hub75FallbackState::None || candidate == Hub75FallbackState::Portal) {
    gHub75FallbackPendingState = candidate;
    gHub75FallbackPendingSinceMs = 0;
    return candidate;
  }

  if (candidate == gHub75FallbackState) {
    gHub75FallbackPendingState = candidate;
    gHub75FallbackPendingSinceMs = 0;
    return candidate;
  }

  if (candidate != gHub75FallbackPendingState) {
    gHub75FallbackPendingState = candidate;
    gHub75FallbackPendingSinceMs = nowMs;
    return Hub75FallbackState::None;
  }

  if (gHub75FallbackPendingSinceMs != 0
      && (nowMs - gHub75FallbackPendingSinceMs) >= kConnectivityFallbackDebounceMs) {
    return candidate;
  }

