eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  return Hub75FallbackState::None;
}

void updateHub75FallbackState(unsigned long nowMs) {
  const Hub75FallbackState nextState = resolveHub75FallbackState(nowMs);
  if (nextState == gHub75FallbackState) {
    return;
  }

  const Hub75FallbackState previousState = gHub75FallbackState;
  gHub75FallbackState = nextState;
  gHub75FallbackDirty = nextState != Hub75FallbackState::None;
  gHub75FallbackClearPending = previousState != Hub75FallbackState::None && nextState == Hub75FallbackState::None;
  if (nextState != Hub75FallbackState::None) {
    gHub75FallbackClearPending = false;
  }

  Serial.printf(
      "[hub75_fallback] previous=%s next=%s\n",
      hub75FallbackStateName(previousState),
      hub75FallbackStateName(nextState));
}

bool clearConnectivityFallbackFrame() {
  if (!gMatrixReady) {
    return false;
  }

  clearMatrix();
  return commitMatrixFrame();
}

bool drawConnectivityFallback(Hub75FallbackState state) {
  if (!gMatrixReady || state == Hub75FallbackState::None) {
    return false;
  }

  const char* title = "";
  const char* subtitle = "";
  RgbColor accent = {0, 0, 0};
  switch (state) {
    case Hub75FallbackState::NoWifi:
      title = "SEM WIFI";
      subtitle = "Conecte a rede";
      accent = {255, 170, 48};
      break;
    case Hub75FallbackState::NoServer:
      title = "SEM SERV";
      subtitle = "Abra o MicaAudio";
      accent = {255, 96, 96};
      break;
    case Hub75FallbackState::Portal:
      title = "SETUP WIFI";
      subtitle = "Conecte no portal";
      accent = {96, 220, 255};
      break;
    case Hub75FallbackState::None:
    default:
      return false;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  clearMatrix();
  const uint16_t accentColor = rgb888ToRgb565(accent.r, accent.g, accent.b);
  const uint16_t titleColor = rgb888ToRgb565(244, 244, 244);
  const uint16_t subtitleColor = rgb888ToRgb565(158, 170, 180);
  drawConnectivityFallbackIcon(state, accentColor, titleColor);
  gMatrix->drawFastHLine(24, 22, kMatrixWidth - 48, rgb888ToRgb565(36, 48, 60));
  drawMatrixTextCentered(title, 36, titleColor, 2);
  drawMatrixTextCentered(subtitle, 50, subtitleColor, 1);
  gMatrixBufferModes[gMatrixShadowBackBufferIndex] = MatrixBufferMode::Clear;
  return commitMatrixFrame();
#else
  return false;
#endif
}

bool commitMatrixFrame() {
#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->flipDMABuffer();
    gLastMatrixPresentUs = micros();
    gHub75PresentFrames++;
    gMatrixShadowBackBufferIndex ^= 1u;
    return true;
  }
#endif

  return false;
}

uint32_t getPhysicalPresentIntervalUs() {
#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr && gMatrix->calculated_refresh_rate > 0) {
    const uint32_t refreshRate = static_cast<uint32_t>(gMatrix->calculated_refresh_rate);
    const uint32_t intervalUs = ceilDivideU32(kMicrosPerSecond, refreshRate);
    return intervalUs == 0 ? 1u : intervalUs;
  }
#endif

  return kHub75FallbackPresentIntervalUs;
}

uint32_t getEffectiveMatrixPresentIntervalUs() {
  const uint32_t physicalPresentIntervalUs = getPhysicalPresentIntervalUs();
  return physicalPresentIntervalUs > kHub75TargetPresentIntervalUs
      ? physicalPresentIntervalUs
      : kHub75TargetPresentIntervalUs;
}

bool shouldPresentMatrixFrame(uint32_t nowUs) {
  return gLastMatrixPresentUs == 0
      || static_cast<uint32_t>(nowUs - gLastMatrixPresentUs) >= getEffectiveMatrixPresentIntervalUs();
}

void markMatrixFrameDirty(bool countAsAppliedFrame) {
  gMatrixFrameDirty = true;
  if (countAsAppliedFrame) {
    gPendingMatrixPresentCountsAsApplied = true;
  }
}

#if defined(MICA_PROFILE_DMA_EXP)
const char* hub75DriverName(HUB75_I2S_CFG::shift_driver driver) {
  switch (driver) {
    case HUB75_I2S_CFG::SHIFTREG:
      return "SHIFTREG";
    case HUB75_I2S_CFG::FM6124:
      return "FM6124";
    case HUB75_I2S_CFG::FM6126A:
      return "FM6126A";
    case HUB75_I2S_CFG::ICN2038S:
      return "ICN2038S";
    case HUB75_I2S_CFG::MBI5124:
      return "MBI5124";
    default:
      return "UNKNOWN";
  }
}
#endif

bool validateMatrixPinConfiguration() {
  if (kMatrixHeight < 64) {
    return true;
  }

  const int ePin = static_cast<int>(kMatrixAddrPins[4]);
  if (ePin < 0) {
    Serial.println("Pinout HUB75 invalido: painel 128x64 exige linha E.");
    return false;
  }

  if (ePin == static_cast<int>(kMatrixClockPin)
      || ePin == static_cast<int>(kMatrixLatchPin)
      || ePin == static_cast<int>(kMatrixOePin)) {
    Serial.printf(
        "Pinout HUB75 invalido: linha E=%d conflita com CLK/LAT/OE.\n",
        ePin);
    return false;
  }

  return true;
}

void logMatrixPinout() {
  Serial.printf(
      "HUB75 pinout RGB={%u,%u,%u,%u,%u,%u} ADDR={%u,%u,%u,%u,%u} LAT=%u OE=%u CLK=%u\n",
      static_cast<unsigned>(kMatrixRgbPins[0]),
      static_cast<unsigned>(kMatrixRgbPins[1]),
      static_cast<unsigned>(kMatrixRgbPins[2]),
      static_cast<unsigned>(kMatrixRgbPins[3]),
      static_cast<unsigned>(kMatrixRgbPins[4]),
      static_cast<unsigned>(kMatrixRgbPins[5]),
      static_cast<unsigned>(kMatrixAddrPins[0]),
      static_cast<unsigned>(kMatrixAddrPins[1]),
      static_cast<unsigned>(kMatrixAddrPins[2]),
      static_cast<unsigned>(kMatrixAddrPins[3]),
      static_cast<unsigned>(kMatrixAddrPins[4]),
      static_cast<unsigned>(kMatrixLatchPin),
      static_cast<unsigned>(kMatrixOePin),
      static_cast<unsigned>(kMatrixClockPin));
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#pontos-de-alteracao-frequente
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-128x64-single-canvas-mapping
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-anti-flicker-com-double-buffer
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-upstream-baseline-fluidity-recovery
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-60-fps-com-pacing-fisico-correto
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-diagnostic-matrix-envs
bool initMatrixDisplay() {

