eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
void publishPendingOtaReportIfNeeded() {
  if (!gMqtt.connected() || !hasPendingOtaContext()) {
    return;
  }

  switch (gPendingOtaBootState) {
    case PendingOtaBootState::PendingVerify:
      if (!gPendingOtaPendingVerifyAnnounced) {
        const String message = String("Primeiro boot apos OTA em validacao segura por ")
            + (kOtaSelfTestWindowMs / 1000UL)
            + " s.";
        sendCommandProgress(gPendingOtaCommandId, 97, "pending-verify", message);
        (void)publishDeviceLog("info", "command", "pending-verify", message, false);
        gPendingOtaPendingVerifyAnnounced = true;
      }
      return;

    case PendingOtaBootState::ValidatedPendingReport:
      sendCommandProgress(
          gPendingOtaCommandId,
          100,
          "validated",
          String("Firmware validado com safe update mode: ") + kFirmwareVersion + ".",
          1);
      clearPendingOtaContext();
      return;

    case PendingOtaBootState::RolledBackPendingReport:
      sendCommandProgress(
          gPendingOtaCommandId,
          100,
          "rolled-back",
          gPendingOtaFailureMessage.length() > 0
              ? gPendingOtaFailureMessage
              : String("Rollback automatico apos OTA. Firmware atual: ") + kFirmwareVersion + ".",
          0);
      clearPendingOtaContext();
      return;

    case PendingOtaBootState::FailedPendingReport:
      sendCommandProgress(
          gPendingOtaCommandId,
          100,
          "failed",
          gPendingOtaFailureMessage.length() > 0
              ? gPendingOtaFailureMessage
              : "Falha ao concluir safe update mode.",
          0);
      clearPendingOtaContext();
      return;

    case PendingOtaBootState::None:
    default:
      return;
  }
}

void requestPendingOtaRollbackAndReboot(const char* errorCode, const String& errorMessage) {
  gPendingOtaFailureCode = (errorCode != nullptr && errorCode[0] != '\0') ? errorCode : "ota_self_test_failed";
  gPendingOtaFailureMessage = errorMessage;
  gPendingOtaBootState = PendingOtaBootState::FailedPendingReport;

  Serial.printf("[ota] solicitando rollback: %s (%s)\n",
      gPendingOtaFailureMessage.c_str(),
      gPendingOtaFailureCode.c_str());
  (void)publishDeviceLog("error", "command", gPendingOtaFailureCode.c_str(), gPendingOtaFailureMessage, false);

  const esp_err_t rollbackError = esp_ota_mark_app_invalid_rollback_and_reboot();
  Serial.printf("[ota] esp_ota_mark_app_invalid_rollback_and_reboot retornou %s\n", esp_err_to_name(rollbackError));
  delay(200);
  ESP.restart();
}

void processPendingOtaSafeUpdate() {
  if (gPendingOtaBootState == PendingOtaBootState::PendingVerify) {
    if (gPendingOtaValidationStartedMs == 0u) {
      gPendingOtaValidationStartedMs = millis();
    }

    if (millis() - gPendingOtaValidationStartedMs >= kOtaSelfTestWindowMs) {
      if (!String(kFirmwareVersion).equalsIgnoreCase(gPendingOtaTargetVersion)) {
        requestPendingOtaRollbackAndReboot(
            "ota_target_version_mismatch",
            "Safe update mode detectou firmware diferente da versao alvo apos o reboot.");
        return;
      }

      const esp_err_t validationError = esp_ota_mark_app_valid_cancel_rollback();
      if (validationError != ESP_OK) {
        requestPendingOtaRollbackAndReboot(
            "ota_mark_valid_failed",
            String("Falha ao confirmar a imagem OTA: ") + esp_err_to_name(validationError) + ".");
        return;
      }

      gPendingOtaBootState = PendingOtaBootState::ValidatedPendingReport;
      gPendingOtaPendingVerifyAnnounced = false;
      gPendingOtaValidationStartedMs = 0u;
      Serial.printf("[ota] imagem OTA validada com sucesso: %s\n", kFirmwareVersion);
    }
  }

  publishPendingOtaReportIfNeeded();
}

bool trySanitizeLargestFreeBlock(uint32_t freeBytes, size_t largestRawBytes, uint32_t& largestSanitizedBytes) {
  if (freeBytes == 0 || largestRawBytes == 0) {
    return false;
  }

  size_t normalizedLargest = largestRawBytes;
  if (normalizedLargest > freeBytes) {
    normalizedLargest = freeBytes;
  }

  if (normalizedLargest == 0) {
    return false;
  }

  largestSanitizedBytes = static_cast<uint32_t>(normalizedLargest);
  return true;
}

uint32_t elapsedMicrosSince(uint32_t startUs) {
  return static_cast<uint32_t>(micros() - startUs);
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#saude-oficial-do-loop
void updateLoopHealthyPercent(uint32_t loopDurationUs) {
  const unsigned long nowMs = millis();
  if (gLoopWindowStartMs == 0) {
    gLoopWindowStartMs = nowMs;
  }

  gLoopWindowIterationCount++;
  if (loopDurationUs <= kHealthyLoopThresholdUs) {
    gLoopWindowHealthyCount++;
  }

  const unsigned long windowElapsedMs = nowMs - gLoopWindowStartMs;
  if (windowElapsedMs < kLoopHealthWindowMs) {
    return;
  }

  uint32_t healthyPercent = 0;
  if (gLoopWindowIterationCount > 0) {
    healthyPercent = static_cast<uint32_t>(
        (static_cast<uint64_t>(gLoopWindowHealthyCount) * 100ULL
            + static_cast<uint64_t>(gLoopWindowIterationCount / 2u))
        / static_cast<uint64_t>(gLoopWindowIterationCount));
  }

  if (healthyPercent > 100u) {
    healthyPercent = 100u;
  }

  gLoopHealthyPercent = static_cast<uint8_t>(healthyPercent);
  gLoopHealthyPercentReady = true;
  gLoopWindowIterationCount = 0;
  gLoopWindowHealthyCount = 0;
  gLoopWindowStartMs = nowMs;
}

void sendTelemetry(bool force) {
  if (!gMqtt.connected() || gDeviceId.isEmpty()) {
    return;
  }

  unsigned long now = millis();
  if (!force && now - gLastTelemetryMs < kTelemetryIntervalMs) {
    return;
  }

  gLastTelemetryMs = now;

  JsonDocument telemetry;
  const bool wifiConnected = WiFi.status() == WL_CONNECTED;
  const uint32_t uptimeSeconds = millis() / 1000UL;
  const uint32_t freeHeapBytes = ESP.getFreeHeap();

  telemetry["deviceId"] = gDeviceId;
  telemetry["wifiConnected"] = wifiConnected;
  telemetry["wifiState"] = gWifiState;
  telemetry["provisioningPortalActive"] = gProvisioningPortalActive;
  telemetry["auxLedAvailable"] = gAuxLedAvailable;
  telemetry["testLedAvailable"] = isTestLedAvailable();
  telemetry["lastWifiEvent"] = gLastWifiEvent;
  telemetry["rssi"] = wifiConnected ? WiFi.RSSI() : -100;
  telemetry["uptimeSeconds"] = uptimeSeconds;
  if (gLoopHealthyPercentReady) {
    telemetry["loopHealthyPercent"] = gLoopHealthyPercent;
  }
  telemetry["freeHeapBytes"] = freeHeapBytes;
  telemetry["streamFramesReceived"] = gStreamFramesReceived;
  telemetry["streamFramesApplied"] = gStreamFramesApplied;
  telemetry["hub75PresentFrames"] = gHub75PresentFrames;
  telemetry["streamSequenceGapCount"] = gStreamSequenceGapCount;
  telemetry["streamInvalidFrameCount"] = gStreamInvalidFrameCount;
  telemetry["networkPollDeferCount"] = gNetworkPollDeferCount;
  telemetry["telemetrySequence"] = ++gTelemetrySequence;
  telemetry["brightnessCap"] = gBrightnessCap;
  telemetry["brightnessRequested"] = gStreamBrightness;
  telemetry["brightnessApplied"] = gAppliedBrightness;
  telemetry["testLedEnabled"] = gTestLedEnabled;
  telemetry["testLedDuty"] = gTestLedDuty;
  if (gHasStreamLastSequence) {
    telemetry["streamLastSequence"] = gStreamLastSequence;
  }

  uint32_t largestHeapBlockBytes = 0;
  if (trySanitizeLargestFreeBlock(freeHeapBytes, heap_caps_get_largest_free_block(MALLOC_CAP_8BIT), largestHeapBlockBytes)) {
    telemetry["largestHeapBlockBytes"] = largestHeapBlockBytes;
  }

  const bool psramAvailable = ESP.getPsramSize() > 0;
  telemetry["psramAvailable"] = psramAvailable;
  if (psramAvailable) {
    const uint32_t freePsramBytes = ESP.getFreePsram();
    telemetry["freePsramBytes"] = freePsramBytes;

