eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
    if (!gMqtt.connected()) {
      if (gMqttDisconnectedSinceMs == 0) {
        gMqttDisconnectedSinceMs = millis();
      }

      const bool shouldReconnectMqtt = (millis() - gMqttDisconnectedSinceMs) >= kMqttReconnectRetryMs;
      if (shouldRunNetworkStep(shouldReconnectMqtt)) {
        connectMqtt();
        gMqttDisconnectedSinceMs = millis();
        finishNetworkStep();
      }
    } else {
      gMqttDisconnectedSinceMs = 0;

      const bool telemetryDue =
          !gDeviceId.isEmpty()
          && (millis() - gLastTelemetryMs) >= kTelemetryIntervalMs;
      if (shouldRunNetworkStep(telemetryDue)) {
        sendTelemetry(false);
        finishNetworkStep();
      }
    }

    if (!gWs.isConnected()) {
      if (shouldRunNetworkStep(gWsDisconnectedSinceMs == 0)) {
        gWsDisconnectedSinceMs = millis();
        setConnectivityState(kWifiStateConnected, "ws_disconnected", false, false);
        finishNetworkStep();
      }

      const bool shouldReconnectWs =
          gWsDisconnectedSinceMs != 0
          && (millis() - gWsDisconnectedSinceMs) > kWsReconnectRetryMs;
      if (shouldRunNetworkStep(shouldReconnectWs)) {
        Serial.println("[ws_disconnected] sem sessao por tempo prolongado; tentando reconectar websocket.");
        connectWebSocket();
        gWsDisconnectedSinceMs = millis();
        finishNetworkStep();
      }
    } else {
      gWsDisconnectedSinceMs = 0;
    }
  }

  const unsigned long nowMs = millis();
  updateHub75FallbackState(nowMs);
  if ((nowMs - gLastFrameMs) > kMatrixSignalTimeoutMs && !gMatrixSignalTimedOut) {
    portENTER_CRITICAL(&gStreamBufferMux);
    memset(gBinsBuffers, 0, sizeof(gBinsBuffers));
    gBinsActiveIndex = 0;
    gLevel = 0;
    memset(gFrameRgb565Buffers, 0, sizeof(gFrameRgb565Buffers));
    gFrameRgb565ActiveIndex = 0;
    portEXIT_CRITICAL(&gStreamBufferMux);
    gFrameModeActive = false;
    gMatrixSignalTimedOut = true;
    gPendingMatrixPresentCountsAsApplied = false;
    markMatrixFrameDirty(false);
  }

  setMatrixBrightness(resolveAppliedBrightness());
  updateTestLedDutyFromBrightness(gAppliedBrightness);
  updateTestLed();

  const uint32_t nowUs = micros();
  if (gMatrixReady && shouldPresentMatrixFrame(nowUs)) {
    bool presented = false;
    bool presentedStreamPayload = false;
    if (gHub75FallbackState != Hub75FallbackState::None) {
      if (gHub75FallbackDirty) {
        presented = drawConnectivityFallback(gHub75FallbackState);
        if (presented) {
          gHub75FallbackDirty = false;
        }
      }
    } else {
      if (gFrameModeActive) {
        if (gMatrixFrameDirty) {
          presented = drawFrame128x64();
          presentedStreamPayload = presented;
        }
      } else if (!gMatrixSignalTimedOut || gMatrixFrameDirty) {
        presented = drawBars();
        presentedStreamPayload = presented;
      }

      if (!presented && gHub75FallbackClearPending) {
        presented = clearConnectivityFallbackFrame();
      }
    }

    if (presented) {
      if (presentedStreamPayload) {
        gMatrixFrameDirty = false;
        if (gPendingMatrixPresentCountsAsApplied) {
          gStreamFramesApplied++;
        }
      }

      gPendingMatrixPresentCountsAsApplied = false;
      gHub75FallbackClearPending = false;
    }
  }

  updateLoopHealthyPercent(elapsedMicrosSince(loopStartedUs));
}
